org/blog/React/what_are_components_and_jsx.org
#+title: Components, JSX and props
#+date: <2022-05-17 Tue>
#+author: Morgan Walsh
#+description: Learn about component based design and how JSX is used to encapsulate logic within those components.
#+keywords: React JavaScript HTML
#+subtitle: An introduction to components and JSX in React 18

React is a user-interface (UI) library for building components, these components represent the markup rendered to the browser display and the logic applied to said markup.

#+BEGIN_QUOTE
User interfaces can be *composed* of many reusable components for presenting data which changes over time.
#+END_QUOTE

There are two ways of creating components in React:

- Class based ES6 components
- Function components

** [[https://reactjs.org/docs/thinking-in-react.html][Thinking in React]]

React is known for its abilities to create dynamic websites, but it requires us to consider how we build web applications a little differently. The React team, as of writing, recommend we follow these steps:

1. Start with a mock

   A *mock* is a design (often a wireframe), possibly with accompanying data for an existing or planned API. Usually, this will be created by designers but if it is a solo project you will be responsible for creating the mocks.

2. Break the UI into a component hierarchy

   In React, we should identify the different components in our design. Take a todo list for example:

   #+BEGIN_EXAMPLE
    ----------------------------------------------+----------
   | Todo                                         | Priority |
    ----------------------------------------------+----------
   | Buy dog food                                 | HIGH     |
   | Write Thinking in React blog post            | MEDIUM   |
   #+END_EXAMPLE

   There are multiple components in this todo list, the list itself can also be considered a component - it is the parent in this hierarchy.

   The header row is a component in the todo list:

   #+BEGIN_EXAMPLE
    ----------------------------------------------+----------
   | Todo                                         | Priority |
    ----------------------------------------------+----------
   #+END_EXAMPLE

   Each todo item can also be considered a component:

   #+BEGIN_EXAMPLE
   | Buy dog food                                 | HIGH     |
   #+END_EXAMPLE

   A simple way of identifying components is to draw boxes around them on your design, this takes practice and is not mastered overnight but can be understood in an hour.

   #+BEGIN_QUOTE
   The single-responsibility principle can be used to great effect in component based design, each component should do one thing and do it well... If the component has more than one responsibility, decompose it into subcomponents.
   #+END_QUOTE

   The hierarchy identified looks as follows:

   - TodoList

     - TodoHeader

     - TodoItem

3. Build a *static version* in React

   Once the component hierarchy is identified, a *static version* of the web application can be created which takes a data model and renders the UI but does not have any dynamic interactivity... yet!

   - Static versions don't require much thinking but do require lots of typing according to the React team, the reasoning here is that you are merely building some HTML templates and as we all should know, mark up can become very verbose very quickly. The interactivity of our pages is the inverse.

   React has a concept of props and state, *props* are used to pass data /down/ the component hierarchy - from parent to child. **State** is reserved for interactivity (the dynamic parts of our websites) which are subject to change over time.

   #+BEGIN_QUOTE
   React uses a *one-way data flow* / *one-way binding* with components, the data passed between components is passed from parent to child - unidirectionally.
   #+END_QUOTE

   There are two ways to approach building the static version:

   - Top-down approach: Start with the components higher up in the hierarchy and work your way down.

   - Bottom-up approach: Start the the components lower in the hierarchy and work your way up.

4. Identify the minimal (but complete) representation of UI state

   To make UI's interactive, React uses *state*. State is used to manage the data that changes in our components. There are three questions you can ask about some data to identify whether it is state or not:

   1. Is it passed in from a parent via props? (probably not state if so)

   2. Does it remain unchanged over time? (probably not state if so)

   3. Can you compute it based on any other state or props in your component? (probably not state if so)

   In the todo list example, the only data is the original list of todo items on which no modifications are made. This would not be stateful in its current form, but would be if we required the ability to add or remove todos from the list.

5. Identify where state should live

   This step is about identifying which component should own the state, this component should then pass the data as props to those child components which require it.

   React recommends the following steps for beginners to be applied to each piece of state in the app:

   - Identify every component which renders something based on the piece of state.

   - Find a common owner component, the highest component in the hierarchy which requires the state.

   - Either the common owner or another higher up component should own the state.

   - If none of the current components make sense holding the piece of state, create a new component for holding the state and add it in the hierarchy above the commmon owner component.

6. Add inverse data flow

   Sometimes, data is required to flow /up/ the hierarchy... React offers a way to perform *two-way data binding* with the ~bind()~ method.

