blog/React/what_are_components_and_jsx.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-05-26 Thu 10:13 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Components, JSX and props</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Morgan Walsh">
<meta name="description" content="Learn about component based design and how JSX is used to encapsulate logic within those components."
>
<meta name="keywords" content="React JavaScript HTML">
<link rel='stylesheet' href='/css/style.css' type='text/css' />
</head>
<body>
<div id="preamble" class="status">
<nav>
  <a id='toggle'>&equiv;</a>
  <a class='nav-link' href='/'>Home</a>
  <a class='nav-link' href='/blog'>Blog</a>
  <a class='nav-link' href='http://github.com/MrWalshy'>GitHub</a>
</nav>
</div>
<div id="content">
<header>
<h1 class="title">Components, JSX and props</h1>
<p class="subtitle">An introduction to components and JSX in React 18</p>
</header><hr>

<p>
React is a user-interface (UI) library for building components, these components represent the markup rendered to the browser display and the logic applied to said markup.
</p>

<blockquote>
<p>
User interfaces can be <b>composed</b> of many reusable components for presenting data which changes over time.
</p>
</blockquote>

<p>
There are two ways of creating components in React:
</p>

<ul class="org-ul">
<li>Class based ES6 components</li>
<li>Function components (this article focuses on function components)</li>
</ul>

<div id="outline-container-org9ce8242" class="outline-2">
<h2 id="org9ce8242"><a href="https://reactjs.org/docs/thinking-in-react.html">Thinking in React</a></h2>
<div class="outline-text-2" id="text-org9ce8242">
<p>
React is known for its abilities to create dynamic websites, but it requires us to consider how we build web applications a little differently. The React team, as of writing, recommend we follow these steps:
</p>

<ol class="org-ol">
<li><p>
Start with a mock
</p>

<p>
A <b>mock</b> is a design (often a wireframe), possibly with accompanying data for an existing or planned API. Usually, this will be created by designers but if it is a solo project you will be responsible for creating the mocks.
</p>

<hr></li>

<li><p>
Break the UI into a component hierarchy
</p>

<p>
In React, we should identify the different components in our design. Take a todo list for example:
</p>

<pre class="example">
 ----------------------------------------------+----------
| Todo                                         | Priority |
 ----------------------------------------------+----------
| Buy dog food                                 | HIGH     |
| Write Thinking in React blog post            | MEDIUM   |
</pre>

<p>
There are multiple components in this todo list, the list itself can also be considered a component - it is the parent in this hierarchy.
</p>

<p>
The header row is a component in the todo list:
</p>

<pre class="example">
 ----------------------------------------------+----------
| Todo                                         | Priority |
 ----------------------------------------------+----------
</pre>

<p>
Each todo item can also be considered a component:
</p>

<pre class="example">
| Buy dog food                                 | HIGH     |
</pre>

<p>
A simple way of identifying components is to draw boxes around them on your design, this takes practice and is not mastered overnight but can be understood in an hour.
</p>

<blockquote>
<p>
The single-responsibility principle can be used to great effect in component based design, each component should do one thing and do it well&#x2026; If the component has more than one responsibility, decompose it into subcomponents.
</p>
</blockquote>

<p>
The hierarchy identified looks as follows:
</p>

<ul class="org-ul">
<li>TodoList

<ul class="org-ul">
<li>TodoHeader</li>

<li>TodoItem</li>
</ul></li>
</ul>

<hr></li>

<li><p>
Build a <b>static version</b> in React
</p>

<p>
Once the component hierarchy is identified, a <b>static version</b> of the web application can be created which takes a data model and renders the UI but does not have any dynamic interactivity&#x2026; yet!
</p>

<ul class="org-ul">
<li>Static versions don't require much thinking but do require lots of typing according to the React team, the reasoning here is that you are merely building some HTML templates and as we all should know, mark up can become very verbose very quickly. The interactivity of our pages is the inverse.</li>
</ul>

<p>
React has a concept of props and state, <b>props</b> are used to pass data <i>down</i> the component hierarchy - from parent to child. <b><b>State</b></b> is reserved for interactivity (the dynamic parts of our websites) which are subject to change over time.
</p>

<blockquote>
<p>
React uses a <b>one-way data flow</b> / <b>one-way binding</b> with components, the data passed between components is passed from parent to child - unidirectionally.
</p>
</blockquote>

<p>
There are two ways to approach building the static version:
</p>

<ul class="org-ul">
<li>Top-down approach: Start with the components higher up in the hierarchy and work your way down.</li>

<li>Bottom-up approach: Start the the components lower in the hierarchy and work your way up.</li>
</ul>

<hr></li>

<li><p>
Identify the minimal (but complete) representation of UI state
</p>

<p>
To make UI's interactive, React uses <b>state</b>. State is used to manage the data that changes in our components. There are three questions you can ask about some data to identify whether it is state or not:
</p>

<ol class="org-ol">
<li>Is it passed in from a parent via props? (probably not state if so)</li>

<li>Does it remain unchanged over time? (probably not state if so)</li>

<li>Can you compute it based on any other state or props in your component? (probably not state if so)</li>
</ol>

<p>
In the todo list example, the only data is the original list of todo items on which no modifications are made. This would not be stateful in its current form, but would be if we required the ability to add or remove todos from the list.
</p>

<hr></li>

<li><p>
Identify where state should live
</p>

<p>
This step is about identifying which component should own the state, this component should then pass the data as props to those child components which require it.
</p>

<p>
React recommends the following steps for beginners to be applied to each piece of state in the app:
</p>

<ul class="org-ul">
<li>Identify every component which renders something based on the piece of state.</li>

<li>Find a common owner component, the highest component in the hierarchy which requires the state.</li>

<li>Either the common owner or another higher up component should own the state.</li>

<li>If none of the current components make sense holding the piece of state, create a new component for holding the state and add it in the hierarchy above the commmon owner component.</li>
</ul>

<hr></li>

<li><p>
Add inverse data flow
</p>

<p>
Sometimes, data is required to flow <i>up</i> the hierarchy&#x2026; React offers a way to perform <b>two-way data binding</b> with the <code>bind()</code> method.
</p></li>
</ol>
</div>
</div>
