org/blog/React/what_are_components_and_jsx.org
** Function components

A *function component* in React is a function which returns a React element using a special syntax known as JSX. *JSX*, created by the React team, allows for both markup and JavaScript to be specified in the same file.

A function component *must* return one of the following:

- a single element, whether part of the native DOM (~<div>~, ~<main>~, etc...) or a custom component defined in React (~<TodoList />~)
- ~null~ or ~false~ to indicate the component should not be rendered

In a new React app, created with ~npx create-react-app components~, add a file called ~src/todo-list-table.js~ and enter the following JSX:

#+BEGIN_SRC js
  import React from 'react';

  const TodoListTable = function() {
      return (
          <table>
              <thead>
                  <tr>
                      <th>Todo</th>
                      <th>Priority</th>
                  </tr>
              </thead>
              <tbody>
                  <tr>
                      <td>Buy dog food</td>
                      <td>HIGH</td>
                  </tr>
              </tbody>
              <tfoot>
                  <tr>
                      <td>Total todo items:</td>
                      <td>1</td>
                  </tr>
              </tfoot>
          </table>
      );
  }

  export default TodoListTable;
#+END_SRC

The import statement brings in React, allowing us to create instances of ~React.Component~. The ~TodoListTable~ function returns JSX, a combination of HTML and JavaScript - currently, this is just plain old HTML being returned with some data. Finally, we export the function component so it can be accessed in other modules.

Alternatively, we could also have used an arrow function instead of a standard function declaration:

#+BEGIN_SRC js
  const TodoListTable = () => (
      <table>
        // ...    
      </table>
  );
#+END_SRC

In ~App.js~, you can then import and render the component inside the return value of the ~App~ function:

#+BEGIN_SRC js
  import React from 'react';
  import TodoListTable from './src/todo-list-table';

  function App() {
      return (
          <TodoListTable />
      );
  }

  export default App;
#+END_SRC

Take note of how the component was specified, there is no closing tag - JSX components are used like HTML, the major difference is that they are self-closing and require a ~/~ before the closing bracket.

** JSX

*JSX* is an extended version of JavaScript developed by the React team for working with React components, JSX allows for HTML markup and JS expressions to be written together.

A simple example would be as follows:

#+BEGIN_SRC js
  const DateDisplay = function() {
      const date = new Date().toLocalString();

      return (
          <div>
              <p>Date: {date}</p>
          </div>
      );
  }
#+END_SRC

The key part to remember here is that functions are objects in JavaScript, we create a function object called ~DateDisplay~ which creates a ~date~ constant to then be inserted in the returned HTML. We then use a set of curly braces, ~{}~ in the returned HTML to write a JS expression - in this case, the expression is ~{date}~ which will evaluate the ~date~ constant declared earlier and insert its value.

*** Conditional rendering

In React, we can conditionally choose what HTML should be returned from a component. There are key points to remember here:

- We *can not* use if statements inside JSX as it is not an expression.
- We *can* use ternary expressions inside JSX.

To conditionally render a component with a ternary expression, we include the ternary expression in the return value of the component - the ternary expression itself could also return further JSX/HTML components. For example:

#+BEGIN_SRC js
  const IsReadyDisplay = () => {

    const isReady = true;

    return (
        <>
            { isReady ?
                <p>Is ready to render content.</p>
                :
                <p>Is not ready to render content</p>
            }
        </>
    );
  }
#+END_SRC

Change the value of ~isReady~ to ~false~ to change the content rendered to the browser window.

We can also conditionally render HTML using logical conditions, for example:

#+BEGIN_SRC js
  const IsReadyDisplay = () => {

      const isReady = false;

      return (
          <>
              {/* display only when isReady is true */}
              {(isReady) && <p>Is ready!</p>}

              {/* display only when isReady is false */}
              {(!isReady) && <p>Is not ready!</p>}
          </>
      );
  }
#+END_SRC

Essentially, we are saying both the condition and the HTML must be truthy that has been supplied in the expression for the HTML to be rendered.

Another way is to offer multiple branches that return values in the function itself rather than the return value, for example:

#+BEGIN_SRC js
  const ConditionComponent = () => {

      const isReady = false;
      const preventRender = false;

      // if statement can't be used inside the JSX, but a ternary can
      if (isReady && !preventRender) return <p>Is ready to render.</p>;
      else if (!isReady) return <p>Is not ready to render.</p>;
      else return <p>Render prevented</p>;
  }
#+END_SRC

As a function is a function object, we could also create nested functions to return JSX.

