blog/React/what_are_components_and_jsx.html

<div id="outline-container-orgd3877da" class="outline-2">
<h2 id="orgd3877da">Function components</h2>
<div class="outline-text-2" id="text-orgd3877da">
<p>
A <b>function component</b> in React is a function which returns a React element using a special syntax known as JSX. <b>JSX</b>, created by the React team, allows for both markup and JavaScript to be specified in the same file.
</p>

<p>
A function component <b>must</b> return one of the following:
</p>

<ul class="org-ul">
<li>a single element, whether part of the native DOM (<code>&lt;div&gt;</code>, <code>&lt;main&gt;</code>, etc&#x2026;) or a custom component defined in React (<code>&lt;TodoList /&gt;</code>)</li>
<li><code>null</code> or <code>false</code> to indicate the component should not be rendered</li>
</ul>

<p>
In a new React app, created with <code>npx create-react-app components</code>, add a file called <code>src/todo-list-table.js</code> and enter the following JSX:
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="font-weight: bold;">import</span> React from <span style="font-style: italic;">'react'</span>;

<span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">TodoListTable</span> = <span style="font-weight: bold;">function</span>() {
    <span style="font-weight: bold;">return</span> (
        &lt;table&gt;
            &lt;thead&gt;
                &lt;tr&gt;
                    &lt;th&gt;Todo&lt;/th&gt;
                    &lt;th&gt;Priority&lt;/th&gt;
                &lt;/tr&gt;
            &lt;/thead&gt;
            &lt;tbody&gt;
                &lt;tr&gt;
                    &lt;td&gt;Buy dog food&lt;/td&gt;
                    &lt;td&gt;HIGH&lt;/td&gt;
                &lt;/tr&gt;
            &lt;/tbody&gt;
            &lt;tfoot&gt;
                &lt;tr&gt;
                    &lt;td&gt;Total todo items:&lt;/td&gt;
                    &lt;td&gt;1&lt;/td&gt;
                &lt;/tr&gt;
            &lt;/tfoot&gt;
        &lt;/table&gt;
    );
}

<span style="font-weight: bold;">export</span> <span style="font-weight: bold;">default</span> TodoListTable;
</pre>
</div>

<p>
The import statement brings in React, allowing us to create instances of <code>React.Component</code>. The <code>TodoListTable</code> function returns JSX, a combination of HTML and JavaScript - currently, this is just plain old HTML being returned with some data. Finally, we export the function component so it can be accessed in other modules.
</p>

<p>
Alternatively, we could also have used an arrow function instead of a standard function declaration:
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">TodoListTable</span> = () =&gt; (
    &lt;table&gt;
      <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">...    </span>
    &lt;/table&gt;
);
</pre>
</div>

<p>
In <code>App.js</code>, you can then import and render the component inside the return value of the <code>App</code> function:
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="font-weight: bold;">import</span> React from <span style="font-style: italic;">'react'</span>;
<span style="font-weight: bold;">import</span> TodoListTable from <span style="font-style: italic;">'./src/todo-list-table'</span>;

<span style="font-weight: bold;">function</span> <span style="font-weight: bold;">App</span>() {
    <span style="font-weight: bold;">return</span> (
        &lt;TodoListTable /&gt;
    );
}

<span style="font-weight: bold;">export</span> <span style="font-weight: bold;">default</span> App;
</pre>
</div>

<p>
Take note of how the component was specified, there is no closing tag - JSX components are used like HTML, the major difference is that they are self-closing and require a <code>/</code> before the closing bracket.
</p>
</div>
</div>

<div id="outline-container-org6cd786c" class="outline-2">
<h2 id="org6cd786c">JSX</h2>
<div class="outline-text-2" id="text-org6cd786c">
<p>
<b>JSX</b> is an extended version of JavaScript developed by the React team for working with React components, JSX allows for HTML markup and JS expressions to be written together.
</p>

<p>
A simple example would be as follows:
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">DateDisplay</span> = <span style="font-weight: bold;">function</span>() {
    <span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">date</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Date</span>().toLocalString();

    <span style="font-weight: bold;">return</span> (
        &lt;div&gt;
            &lt;p&gt;Date: {date}&lt;/p&gt;
        &lt;/div&gt;
    );
}
</pre>
</div>

<p>
The key part to remember here is that functions are objects in JavaScript, we create a function object called <code>DateDisplay</code> which creates a <code>date</code> constant to then be inserted in the returned HTML. We then use a set of curly braces, <code>{}</code> in the returned HTML to write a JS expression - in this case, the expression is <code>{date}</code> which will evaluate the <code>date</code> constant declared earlier and insert its value.
</p>
</div>

<div id="outline-container-org536b04a" class="outline-3">
<h3 id="org536b04a">Conditional rendering</h3>
<div class="outline-text-3" id="text-org536b04a">
<p>
In React, we can conditionally choose what HTML should be returned from a component. There are key points to remember here:
</p>

<ul class="org-ul">
<li>We <b>can not</b> use if statements inside JSX as it is not an expression.</li>
<li>We <b>can</b> use ternary expressions inside JSX.</li>
</ul>

<p>
To conditionally render a component with a ternary expression, we include the ternary expression in the return value of the component - the ternary expression itself could also return further JSX/HTML components. For example:
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">IsReadyDisplay</span> = () =&gt; {

  <span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">isReady</span> = <span style="font-weight: bold; text-decoration: underline;">true</span>;

  <span style="font-weight: bold;">return</span> (
      &lt;&gt;
          { isReady ?
              &lt;p&gt;Is ready to render content.&lt;/p&gt;
              :
              &lt;p&gt;Is not ready to render content&lt;/p&gt;
          }
      &lt;/&gt;
  );
}
</pre>
</div>

<p>
Change the value of <code>isReady</code> to <code>false</code> to change the content rendered to the browser window.
</p>

<p>
We can also conditionally render HTML using logical conditions, for example:
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">IsReadyDisplay</span> = () =&gt; {

    <span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">isReady</span> = <span style="font-weight: bold; text-decoration: underline;">false</span>;

    <span style="font-weight: bold;">return</span> (
        &lt;&gt;
            {<span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">display only when isReady is true */</span>}
            {(isReady) &amp;&amp; &lt;p&gt;Is ready!&lt;/p&gt;}

            {<span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">display only when isReady is false */</span>}
            {(!isReady) &amp;&amp; &lt;p&gt;Is not ready!&lt;/p&gt;}
        &lt;/&gt;
    );
}
</pre>
</div>

<p>
Essentially, we are saying both the condition and the HTML must be truthy that has been supplied in the expression for the HTML to be rendered.
</p>

<p>
Another way is to offer multiple branches that return values in the function itself rather than the return value, for example:
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">ConditionComponent</span> = () =&gt; {

    <span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">isReady</span> = <span style="font-weight: bold; text-decoration: underline;">false</span>;
    <span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">preventRender</span> = <span style="font-weight: bold; text-decoration: underline;">false</span>;

    <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">if statement can't be used inside the JSX, but a ternary can</span>
    <span style="font-weight: bold;">if</span> (isReady &amp;&amp; !preventRender) <span style="font-weight: bold;">return</span> &lt;p&gt;Is ready to render.&lt;/p&gt;;
    <span style="font-weight: bold;">else</span> <span style="font-weight: bold;">if</span> (!isReady) <span style="font-weight: bold;">return</span> &lt;p&gt;Is not ready to render.&lt;/p&gt;;
    <span style="font-weight: bold;">else</span> <span style="font-weight: bold;">return</span> &lt;p&gt;Render prevented&lt;/p&gt;;
}
</pre>
</div>

<p>
As a function is a function object, we could also create nested functions to return JSX.
</p>
</div>
</div>
