org/blog/React/what_are_components_and_jsx.org
*** Rendering arrays of data

React makes use of ES6 functionality to offer us the ability to easily map data to HTML using JSX. The following example demonstrates rendering a list of user data:

#+BEGIN_SRC js
  const UsernameList = () => {

      const users = [
          { username: "Fred", age: 22 },
          { username: "Bob", age: 25 },
          { username: "Sarah", age: 23 }
      ]

      // each user is mapped
      const usernameList = users.map((user, index) => <li key={index}>{user.username}</li>);

      return (
          <div>
              <h2>Usernames</h2>
              <ul>
                  {usernameList}
              </ul> 
          </div>
      );
  }
#+END_SRC

Each element in a list in React requires a unique key property to help React differentiate and reconciliate the React virtual DOM and the actual DOM.

#+BEGIN_QUOTE
*IMPORTANT*: It is the JavaScript list that is requiring us to specify a key to the elements we map to.
#+END_QUOTE

We could map the username list to different elements if we wanted as well:

#+BEGIN_SRC js
  const EditUserForms = () => {

      const users = [
          { username: "Fred", age: 22 },
          { username: "Bob", age: 25 },
          { username: "Sarah", age: 23 }
      ]

      {/* Each user is mapped to a form element */}
      const userEditForms = users.map(user => 
                                      <form key={user.username}>
                                          <h3>{user.username} | Edit profile</h3>
                                          <label htmlFor="age">Age: </label>
                                          <input type="number" id="age" style="display: block;" defaultValue={user.age} />
                                      </form>
      );

      return (
          <div>
              {userEditForms}
          </div>
      )
  }
#+END_SRC

** Props

React uses a unidirectional data flow where data only flows from parent components to child components. React uses *props* to enable this, a unique object that every React component has to represent passed-in attributes.

- Data that does not change over a components lifecycle should be passed as props to it
- Data that does change over a components lifecycle should be considered as state

#+BEGIN_QUOTE
React has a common saying, "*State* should be the single source of truth for changing data". The state can then be passed as props to components which require it.
#+END_QUOTE

*** Applying props

Props are easy to get started with, each prop represents an immutable piece of data passed to a component as an attribute.

We will use the form from the previous rendering arrays example to illustrate how props can be used:

#+BEGIN_SRC js
  const EditUserForm = function(props) => (
          <form>
              <h3>{props.user.username} | Edit profile</h3>

              {/*
                 The input is data that changes during the lifecycle of the component, this represents state and will be explored in a different article.
              /*}
              <label htmlFor="age">Age: </label>
              <input type="number" id="age" style="display: block;" defaultValue={props.user.age} />
          </form>
  );
#+END_SRC

- Take note of how we access data using the passed in props object, ~{props.property}~...

Now, the component using props can be used to render a list of users more concisely:

#+BEGIN_SRC js
  const EditUserForms = (props) => {

      const users = [
          { username: "Fred", age: 22 },
          { username: "Bob", age: 25 },
          { username: "Sarah", age: 23 }
      ]

      {/* Each user is mapped to a form element */}
      const userEditForms = users.map(user => <EditUserForm key={user.username} user={user} />);

      return (
          <div>
              {userEditForms}
          </div>
      );
  }
#+END_SRC

The key part in this example is when we map the array, we pass a ~user~ attribute to the ~EditUserForm~ elements props so that it can be accessed in the child component.

*** Default properties

We can also apply default properties to a component using the ~Component.defaultProps~ property:

#+BEGIN_SRC js
  const BlogPost = (props) => (
      <article>
          <div id="blog-head">
              <h1>{props.title}</h1>
              <p>{props.subtitle}</p>
          </div>
          <div id="blog-content">
              {props.content}
          </div>
      </article>
  );

  BlogPost.defaultProps = {
      title: "404 - Post not found",
      subtitle: "",
      content: "Something went wrong, please try again later or report an issue with the service..."
  }
#+END_SRC

We could improve this example by splitting up the blog into its constituent components:

#+BEGIN_SRC js
  const BlogHead = (props) => (
      <div id="blog-head">
          <h1>{props.title}</h1>
          <p>{props.subtitle}</p>
      </div>
  );

  const BlogBody = (props) => (
      <div id="blog-content">
          {props.content}
      </div>
  );

  const BlogPost = (props) => (
      <article>
          <BlogHead title={props.post.title} subtitle={props.post.subtitle} />
          <BlogBody content={props.post.content} />
      </article>
  );

  BlogPost.defaultProps = {
      title: "404 - Post not found",
      subtitle: "",
      content: "Something went wrong, please try again later or report an issue with the service..."
  }
#+END_SRC
