blog/React/what_are_components_and_jsx.html

<div id="outline-container-org5fdd0de" class="outline-3">
<h3 id="org5fdd0de">Rendering arrays of data</h3>
<div class="outline-text-3" id="text-org5fdd0de">
<p>
React makes use of ES6 functionality to offer us the ability to easily map data to HTML using JSX. The following example demonstrates rendering a list of user data:
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">UsernameList</span> = () =&gt; {

    <span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">users</span> = [
        { username: <span style="font-style: italic;">"Fred"</span>, age: 22 },
        { username: <span style="font-style: italic;">"Bob"</span>, age: 25 },
        { username: <span style="font-style: italic;">"Sarah"</span>, age: 23 }
    ]

    <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">each user is mapped</span>
    <span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">usernameList</span> = users.map((user, index) =&gt; &lt;li key={index}&gt;{user.username}&lt;/li&gt;);

    <span style="font-weight: bold;">return</span> (
        &lt;div&gt;
            &lt;h2&gt;Usernames&lt;/h2&gt;
            &lt;ul&gt;
                {usernameList}
            &lt;/ul&gt; 
        &lt;/div&gt;
    );
}
</pre>
</div>

<p>
Each element in a list in React requires a unique key property to help React differentiate and reconciliate the React virtual DOM and the actual DOM.
</p>

<blockquote>
<p>
<b>IMPORTANT</b>: It is the JavaScript list that is requiring us to specify a key to the elements we map to.
</p>
</blockquote>

<p>
We could map the username list to different elements if we wanted as well:
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">EditUserForms</span> = () =&gt; {

    <span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">users</span> = [
        { username: <span style="font-style: italic;">"Fred"</span>, age: 22 },
        { username: <span style="font-style: italic;">"Bob"</span>, age: 25 },
        { username: <span style="font-style: italic;">"Sarah"</span>, age: 23 }
    ]

    {<span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">Each user is mapped to a form element */</span>}
    <span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">userEditForms</span> = users.map(user =&gt; 
                                    &lt;form key={user.username}&gt;
                                        &lt;h3&gt;{user.username} | Edit profile&lt;/h3&gt;
                                        &lt;label htmlFor=<span style="font-style: italic;">"age"</span>&gt;Age: &lt;/label&gt;
                                        &lt;input type=<span style="font-style: italic;">"number"</span> id=<span style="font-style: italic;">"age"</span> defaultValue={user.age} /&gt;
                                    &lt;/form&gt;
    );

    <span style="font-weight: bold;">return</span> (
        &lt;div&gt;
            {userEditForms}
        &lt;/div&gt;
    )
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1b60ddf" class="outline-2">
<h2 id="org1b60ddf">Props</h2>
<div class="outline-text-2" id="text-org1b60ddf">
<p>
React uses a unidirectional data flow where data only flows from parent components to child components. React uses <b>props</b> to enable this, a unique object that every React component has to represent passed-in attributes.
</p>

<ul class="org-ul">
<li>Data that does not change over a components lifecycle should be passed as props to it</li>
<li>Data that does change over a components lifecycle should be considered as state</li>
</ul>

<blockquote>
<p>
React has a common saying, "<b>State</b> should be the single source of truth for changing data". The state can then be passed as props to components which require it.
</p>
</blockquote>
</div>

<div id="outline-container-orgfe3bec9" class="outline-3">
<h3 id="orgfe3bec9">Applying props</h3>
<div class="outline-text-3" id="text-orgfe3bec9">
<p>
Props are easy to get started with, each prop represents an immutable piece of data passed to a component as an attribute.
</p>

<p>
We will use the form from the previous rendering arrays example to illustrate how props can be used:
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">EditUserForm</span> = <span style="font-weight: bold;">function</span>(<span style="font-weight: bold; font-style: italic;">props</span>) =&gt; (
        &lt;form&gt;
            &lt;h3&gt;{props.user.username} | Edit profile&lt;/h3&gt;

            {<span style="font-weight: bold; font-style: italic;">/*</span>
<span style="font-weight: bold; font-style: italic;">               The input is data that changes during the lifecycle of the component, this represents state and will be explored in a different article.</span>
<span style="font-weight: bold; font-style: italic;">            */</span>}
            &lt;label htmlFor=<span style="font-style: italic;">"age"</span>&gt;Age: &lt;/label&gt;
            &lt;input type=<span style="font-style: italic;">"number"</span> id=<span style="font-style: italic;">"age"</span> defaultValue={props.user.age} /&gt;
        &lt;/form&gt;
);
</pre>
</div>

<ul class="org-ul">
<li>Take note of how we access data using the passed in props object, <code>{props.property}</code>&#x2026;</li>
</ul>

<p>
Now, the component using props can be used to render a list of users more concisely:
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">EditUserForms</span> = (props) =&gt; {

    <span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">users</span> = [
        { username: <span style="font-style: italic;">"Fred"</span>, age: 22 },
        { username: <span style="font-style: italic;">"Bob"</span>, age: 25 },
        { username: <span style="font-style: italic;">"Sarah"</span>, age: 23 }
    ]

    {<span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">Each user is mapped to a form element */</span>}
    <span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">userEditForms</span> = users.map(user =&gt; &lt;EditUserForm key={user.username} user={user} /&gt;);

    <span style="font-weight: bold;">return</span> (
        &lt;div&gt;
            {userEditForms}
        &lt;/div&gt;
    );
}
</pre>
</div>

<p>
The key part in this example is when we map the array, we pass a <code>user</code> attribute to the <code>EditUserForm</code> elements props so that it can be accessed in the child component.
</p>
</div>
</div>

<div id="outline-container-org250d3c6" class="outline-3">
<h3 id="org250d3c6">Default properties</h3>
<div class="outline-text-3" id="text-org250d3c6">
<p>
We can also apply default properties to a component using the <code>Component.defaultProps</code> property:
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">BlogPost</span> = (props) =&gt; (
    &lt;article&gt;
        &lt;div id=<span style="font-style: italic;">"blog-head"</span>&gt;
            &lt;h1&gt;{props.title}&lt;/h1&gt;
            &lt;p&gt;{props.subtitle}&lt;/p&gt;
        &lt;/div&gt;
        &lt;div id=<span style="font-style: italic;">"blog-content"</span>&gt;
            {props.content}
        &lt;/div&gt;
    &lt;/article&gt;
);

BlogPost.defaultProps = {
    title: <span style="font-style: italic;">"404 - Post not found"</span>,
    subtitle: <span style="font-style: italic;">""</span>,
    content: <span style="font-style: italic;">"Something went wrong, please try again later or report an issue with the service..."</span>
}
</pre>
</div>

<p>
We could improve this example by splitting up the blog into its constituent components:
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">BlogHead</span> = (props) =&gt; (
    &lt;div id=<span style="font-style: italic;">"blog-head"</span>&gt;
        &lt;h1&gt;{props.title}&lt;/h1&gt;
        &lt;p&gt;{props.subtitle}&lt;/p&gt;
    &lt;/div&gt;
);

<span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">BlogBody</span> = (props) =&gt; (
    &lt;div id=<span style="font-style: italic;">"blog-content"</span>&gt;
        {props.content}
    &lt;/div&gt;
);

<span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">BlogPost</span> = (props) =&gt; (
    &lt;article&gt;
        &lt;BlogHead title={props.post.title} subtitle={props.post.subtitle} /&gt;
        &lt;BlogBody content={props.post.content} /&gt;
    &lt;/article&gt;
);

BlogPost.defaultProps = {
    title: <span style="font-style: italic;">"404 - Post not found"</span>,
    subtitle: <span style="font-style: italic;">""</span>,
    content: <span style="font-style: italic;">"Something went wrong, please try again later or report an issue with the service..."</span>
}
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr />
<footer>
  <p>
    Last updated 2022-05-26 Thu 10:12. <br />
    Built with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9). <br />
    <a href="/html/bug-report.html">Submit a bug report</a>
  </p>
  <p><small>Copyright 2022 Morgan Walsh.</small></p>
</footer>
<script src='/js/navbar.js'></script>
</div>
</body>
</html>
